Documents/ОтменаСкидокНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ОтменаСкидокНоменклатуры</Name>
			<Comment>(Упр)</Comment>
			<BasedOn>
				<xr:Item>Document.УстановкаСкидокНоменклатуры</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СкидкиНоменклатурыНатуральные</xr:Item>
				<xr:Item>InformationRegister.СкидкиНаценкиНоменклатуры</xr:Item>
				<xr:Item>InformationRegister.СкидкиНаценкиПоЦеновымГруппам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Документы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УстановкаСкидокНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.УстановкаСкидокНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/СкидкиНаценкиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СкидкиНаценкиНоменклатуры</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПроцентСкидкиНаценки</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОграничениеСкидкиНаценки</Name>
					<Comment>(Общ) Окраничение скидки, наценки.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Условие</Name>
					<Comment>(Общ) Условие скидки-наценки</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.УсловияСкидкиНаценки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗначениеУсловия</Name>
					<Comment>(Общ) Значение условия скидки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОплатЧекаККМ</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыДисконтныхКарт</v8:Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПолучательСкидки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СкидкиНаценкиПоЦеновымГруппам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СкидкиНаценкиПоЦеновымГруппам</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПроцентСкидкиНаценки</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОграничениеСкидкиНаценки</Name>
					<Comment>(Общ) Окраничение скидки, наценки.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЦеноваяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Условие</Name>
					<Comment>(Общ) Условие скидки-наценки</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.УсловияСкидкиНаценки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗначениеУсловия</Name>
					<Comment>(Общ) Значение условия скидки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОплатЧекаККМ</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыДисконтныхКарт</v8:Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПолучательСкидки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СкидкиНоменклатурыНатуральные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СкидкиНоменклатурыНатуральные</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СпецПредложение</Name>
					<Comment>(Общ) Комплект номенклатуры и бонусов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХарактеристикаСпецПредложения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПолучательСкидки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ОтменаСкидокНоменклатуры/Ext/ObjectModule.bsl
Перем мУдалятьДвижения;

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

// Выполняет действия при вводе на основании
//
Процедура ЗаполнитьПоОснованию(Основание) Экспорт
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.УстановкаСкидокНоменклатуры") Тогда

		Если Документы.Найти(Основание) = Неопределено Тогда
			СтрокаДокумента = Документы.Добавить();
			СтрокаДокумента.УстановкаСкидокНоменклатуры = Основание;
		КонецЕсли;

	КонецЕсли;
КонецПроцедуры //ЗаполнитьПоОснованию()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Возвращает таблицу движений документов "УстановкаСкидокНоменклатуры",
// указанных в списке отмены, по номенклатуре
//
Функция ПодготовитьТаблицуДвиженийНоменклатура(СписокДокументов)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистраторы", СписокДокументов);
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	СкидкиНаценкиНоменклатуры.ПолучательСкидки,
	|	СкидкиНаценкиНоменклатуры.Номенклатура,
	|	СкидкиНаценкиНоменклатуры.ХарактеристикаНоменклатуры,
	|	СкидкиНаценкиНоменклатуры.Качество,
	|	СкидкиНаценкиНоменклатуры.Условие,
	|	СкидкиНаценкиНоменклатуры.ЗначениеУсловия,
	|	СкидкиНаценкиНоменклатуры.ОграничениеСкидкиНаценки
	|ИЗ
	|	РегистрСведений.СкидкиНаценкиНоменклатуры КАК СкидкиНаценкиНоменклатуры
	|
	|ГДЕ
	|	СкидкиНаценкиНоменклатуры.Регистратор В(&Регистраторы)";

	Запрос.Текст = ТекстЗапроса;
	ТаблицаДвижений = Запрос.Выполнить().Выгрузить();

	Возврат ТаблицаДвижений;

КонецФункции //ПодготовитьТаблицуДвиженийНоменклатура()

// Возвращает таблицу движений документов "УстановкаСкидокНоменклатуры",
// указанных в списке отмены, по ценовым группам
//
Функция ПодготовитьТаблицуДвиженийЦеновыеГруппы(СписокДокументов)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистраторы", СписокДокументов);
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	СкидкиНаценкиПоЦеновымГруппам.ПолучательСкидки,
	|	СкидкиНаценкиПоЦеновымГруппам.ЦеноваяГруппа,
	|	СкидкиНаценкиПоЦеновымГруппам.Качество,
	|	СкидкиНаценкиПоЦеновымГруппам.Условие,
	|	СкидкиНаценкиПоЦеновымГруппам.ЗначениеУсловия,
	|	СкидкиНаценкиПоЦеновымГруппам.ОграничениеСкидкиНаценки
	|ИЗ
	|	РегистрСведений.СкидкиНаценкиПоЦеновымГруппам КАК СкидкиНаценкиПоЦеновымГруппам
	|
	|ГДЕ
	|	СкидкиНаценкиПоЦеновымГруппам.Регистратор В(&Регистраторы)";

	Запрос.Текст = ТекстЗапроса;
	ТаблицаДвижений = Запрос.Выполнить().Выгрузить();

	Возврат ТаблицаДвижений;

КонецФункции //ПодготовитьТаблицуДвиженийЦеновыеГруппы()

// Возвращает таблицу движений документов "УстановкаСкидокНоменклатуры",
// указанных в списке отмены, по бонусам
//
Функция ПодготовитьТаблицуДвиженийБонусы(СписокДокументов)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистраторы", СписокДокументов);
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	СкидкиНоменклатурыНатуральные.ПолучательСкидки,
	|	СкидкиНоменклатурыНатуральные.Номенклатура,
	|	СкидкиНоменклатурыНатуральные.ХарактеристикаНоменклатуры,
	|	СкидкиНоменклатурыНатуральные.Количество,
	|	СкидкиНоменклатурыНатуральные.Качество
	|ИЗ
	|	РегистрСведений.СкидкиНоменклатурыНатуральные КАК СкидкиНоменклатурыНатуральные
	|
	|ГДЕ
	|	СкидкиНоменклатурыНатуральные.Регистратор В(&Регистраторы)";

	Запрос.Текст = ТекстЗапроса;
	ТаблицаДвижений = Запрос.Выполнить().Выгрузить();

	Возврат ТаблицаДвижений;

КонецФункции //ПодготовитьТаблицуДвиженийЦеновыеГруппы()

 // Выполняет движения по регистрам 
//
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаПоДокументамНоменклатура, ТаблицаПоДокументамЦеновыеГруппы, ТаблицаПоДокументамБонусы, Отказ, Заголовок)
	
	// Заполним таблицу движений по номенклатуре
	НаборДвижений   = Движения.СкидкиНаценкиНоменклатуры;
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
	
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоДокументамНоменклатура, ТаблицаДвижений);

	НаборДвижений.мПериод          = СтруктураШапкиДокумента.Дата;
	НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;
	
	Если (Не Отказ) Тогда
		Движения.СкидкиНаценкиНоменклатуры.ВыполнитьДвижения();
	КонецЕсли;
	
	// Заполним таблицу движений по ценовым группам
	НаборДвижений   = Движения.СкидкиНаценкиПоЦеновымГруппам;
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
	
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоДокументамЦеновыеГруппы, ТаблицаДвижений);
	
	НаборДвижений.мПериод          = СтруктураШапкиДокумента.Дата;
	НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;
	
	Если (Не Отказ) Тогда
		Движения.СкидкиНаценкиПоЦеновымГруппам.ВыполнитьДвижения();
	КонецЕсли;
	
	// Заполним таблицу движений по бонусам
	НаборДвижений   = Движения.СкидкиНоменклатурыНатуральные;
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
	
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоДокументамБонусы, ТаблицаДвижений);
	
	НаборДвижений.мПериод          = СтруктураШапкиДокумента.Дата;
	НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;
	
	Если (Не Отказ) Тогда
		Движения.СкидкиНоменклатурыНатуральные.ВыполнитьДвижения();
	КонецЕсли;
	
КонецПроцедуры // ДвиженияПоРегистрам()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Обработчик события "ОбработкаПроведения"
//
Процедура ОбработкаПроведения(Отказ, Режим)

	
	Если мУдалятьДвижения Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;

	// Сформируем структуру реквизитов шапки документа
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);

	// Заполним по шапке документа дерево параметров, нужных при проведении.
	ДеревоПолейЗапросаПоШапке = ОбщегоНазначения.СформироватьДеревоПолейЗапросаПоШапке();

	// Сформируем запрос на дополнительные параметры, нужные при проведении, по данным шапки документа
	СтруктураШапкиДокумента = УправлениеЗапасами.СформироватьЗапросПоДеревуПолей(ЭтотОбъект, ДеревоПолейЗапросаПоШапке, СтруктураШапкиДокумента, "");

	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(СтруктураШапкиДокумента);

	СтруктураОбязательныхПолей = Новый Структура("УстановкаСкидокНоменклатуры");
	// Теперь вызовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "Документы", СтруктураОбязательныхПолей, Отказ, Заголовок);

	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("УстановкаСкидокНоменклатуры", "УстановкаСкидокНоменклатуры");

	РезультатЗапросаПоДокументам = ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Документы", СтруктураПолей);
	ТаблицаПоДокументамНоменклатура = ПодготовитьТаблицуДвиженийНоменклатура(РезультатЗапросаПоДокументам.Выгрузить().ВыгрузитьКолонку("УстановкаСкидокНоменклатуры"));
	ТаблицаПоДокументамЦеновыеГруппы = ПодготовитьТаблицуДвиженийЦеновыеГруппы(РезультатЗапросаПоДокументам.Выгрузить().ВыгрузитьКолонку("УстановкаСкидокНоменклатуры"));
	ТаблицаПоДокументамБонусы = ПодготовитьТаблицуДвиженийБонусы(РезультатЗапросаПоДокументам.Выгрузить().ВыгрузитьКолонку("УстановкаСкидокНоменклатуры"));

	Если ТаблицаПоДокументамНоменклатура.Количество() = 0
	   И ТаблицаПоДокументамЦеновыеГруппы.Количество() = 0
	   И ТаблицаПоДокументамБонусы.Количество() = 0 Тогда
	   ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Не найдены движения по документам, указанным для отмены';uk='Не знайдено рухи по документам, вказаним для скасування'"), Отказ, Заголовок);
	КонецЕсли;
	
	Если Не Отказ Тогда
		ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаПоДокументамНоменклатура, ТаблицаПоДокументамЦеновыеГруппы, ТаблицаПоДокументамБонусы, Отказ, Заголовок);
	КонецЕсли;

КонецПроцедуры	// ОбработкаПроведения()

// Обработчик события "ОбработкаЗаполнения"
//
Процедура ОбработкаЗаполнения(Основание)

	ЗаполнитьПоОснованию(Основание);

КонецПроцедуры //ОбработкаЗаполнения()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	мУдалятьДвижения = НЕ ЭтоНовый();

КонецПроцедуры // ПередЗаписью

Процедура ОбработкаУдаленияПроведения(Отказ)

	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);

КонецПроцедуры // ОбработкаУдаленияПроведения
